# Problem Set - 2

# Question 1

Consider the following Python module:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2
After importing the module into the interpreter, you execute:
>>> b()
>>> b()
>>> b()
>>> a
?
What value is displayed when the last expression (a) is evaluated? Explain your
answer by indicating what happens in every executed statement.

In [1]:
a=0
def b():
    global a
    a=c(a)
def c(a):
    return a + 2

In [2]:
b()

In [3]:
b()

In [4]:
b()

In [5]:
a

6

# Question 2

In [6]:
def file_length(filename):
    try:
        file = open(filename)
        contents = file.read()
        file.close()
        print(len(contents))
    except:
        print('File {} not found'.format(filename))

In [7]:
file_length('filelength.txt')

123

In [8]:
file_length('idterm.py')

File idterm.py not found

# Question 3

Write a class named Marsupial that can be used as shown below:
    
>>> m = Marsupial()
>>> m.put_in_pouch('doll')
>>> m.put_in_pouch('firetruck')
>>> m.put_in_pouch('kitten')
>>> m.pouch_contents()
['doll', 'firetruck', 'kitten']

In [9]:
class  Marsupial:
    def __init__(self):
        self.lst=[]
    def put_in_pouch(self,item):
        self.lst.append(item)
    def pouch_content(self):
        return self.lst
m=Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('Kitten')
m.pouch_content()

['doll', 'firetruck', 'Kitten']

Now write a class named Kangaroo as a subclass of Marsupial that inherits all the
attributes of Marsupial and also:
a. extends the Marsupial __init__ constructor to take, as input, the
coordinates x and y of the Kangaroo object,
b. supports method jump that takes number values dx and dy as input and
moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and
c. overloads the __str__ operator so it behaves as shown below.

In [10]:
class  Marsupial:
    def __init__(self):
        self.lst=[]
    def put_in_pouch(self,item):
        self.lst.append(item)
    def pouch_content(self):
        return self.lst

In [11]:
class Kangroo(Marsupial):
    def __init__(self,xcoord,ycoord):
        Marsupial.__init__(self)
        self.x=xcoord
        self.y=ycoord
    def jump(self,dx,dy):
        self.x +=dx
        self.y +=dy
    def __str__(self):
        return 'I am a kangaroo located at coordinates({},{})'.format(self.x,self.y)
k=Kangroo(0,0)
print(k)

I am a kangaroo located at coordinates(0,0)

In [12]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_content()

['doll', 'firetruck', 'kitten']

In [13]:
k.jump(1,0)

In [14]:
k.jump(1,0)
k.jump(1,0)
print(k)

I am a kangaroo located at coordinates(3,0)

# Question 4

Write function collatz() that takes a positive integer x as input and prints the
Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying
this rule to the previous number x in the sequence:
x = {
洧논/2 洧녰洧녭 洧논 洧녰洧 洧뉧롐洧뉧롐뜦n3洧논 + 1 洧녰洧녭 洧논 洧녰洧 洧녶洧녬洧녬
Your function should stop when the sequence gets to number 1. Your
implementation must be recursive, without any loops.

In [15]:
def collatz(a):
    print(a)
    if a==1:
        return
    elif a%2==0:
        return collatz(a/2)
    else:
        return collatz(3*a+1)

In [16]:
collatz(1)

1

In [17]:
collatz(10)

10
5.0
16.0
8.0
4.0
2.0
1.0

# Question 5

Write a recursive method binary() that takes a non-negative
integer n and prints the binary representation of integer n
>>> binary(0)
0
>>> binary(1)
1
>>> binary(3)
11
>>> binary(9)
1001

In [18]:
def binary(num):
    if(num>0):
        binary(num//2)
        print(num%2, end='')

In [19]:
binary(0)

In [20]:
binary(1)

1

In [21]:
binary(3)

11

In [22]:
binary(9)

1001

# Question 6

Implement a class named HeadingParser that can be used to parse an HTML
document, and retrieve and print all the headings in the document. You should
implement your class as a subclass of HTMLParser, defined in Standard Library
module html.parser. When fed a string containing HTML code, your class should
print the headings, one per line and in the order in which they appear in the
document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 heading should have indentation 1, etc. Test your
implementation using w3c.html

In [23]:
from html.parser import HTMLParser
class HeadingParser(HTMLParser):
    def handle_starttag(self, tag, attrs):
        if tag == 'h1':
            print("Start: ", tag)
           # for attr in attrs:
           # print("     attr:", attr)
    def handle_endtag(slef, tag):
        print("End :",tag)
    def handle_data(self, data):
        print("Data :", data)

infile = open('C:/Users/Alpha/Downloads/w3c.html') 
content = infile.readline() 
infile.close()
hp=HeadingParser()   
hp.feed(content)

Data :

# Question 7

Implement recursive function webdir() that takes as input: a URL (as a string) and
non-negative integers depth and indent. Your function should visit every web
page reachable from the starting URL web page in depth clicks or less, and print
each web page's URL. As shown below, indentation, specified by indent, should
be used to indicate the depth of a URL.

In [24]:
#Reference from week Lecture
from urllib.request import urlopen
from urllib.parse import urljoin
from html.parser import HTMLParser
def webdir(url):
    print('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0, url)
    content = urlopen(url).read().decode()
    collector = Collector(url)
    collector.feed(content)
    urls = collector.getLinks()          
    print('\n{:45} {:10}'.format('URL', 'link'))
    for link in urls:
        print('{:45} {:10}'.format(url, link))
    return urls

# Question 8

Write SQL queries on the below database table that return:
a) All the temperature data.
b) All the cities, but without repetition.
c) All the records for India.
d) All the Fall records.
e) The city, country, and season for which the average rainfall is between 200
and 400 millimeters.
f) The city and country for which the average Fall temperature is above 20
degrees, in increasing temperature order.
g) The total annual rainfall for Cairo.
h) The total rainfall for each season.

In [25]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\alpha\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\users\alpha\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\alpha\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: ipython>=1.0 in c:\users\alpha\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\alpha\anaconda3\lib\site-packages (from ipython-sql) (1.4.22)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\alpha\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\alpha\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: colorama in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: pickleshare in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: matplotlib-inline in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: decorator in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pygments in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: jedi>=0.16 in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: backcall in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\alpha\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\alpha\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\alpha\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\alpha\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

In [26]:
%load_ext sql

In [27]:
%sql sqlite://

In [28]:
pip install --upgrade pip

Requirement already satisfied: pip in c:\users\alpha\anaconda3\lib\site-packages (22.0.4)
Note: you may need to restart the kernel to use updated packages.

In [29]:
%%sql
CREATE TABLE Weather
(City varchar(6),
 Country varchar(6),
 Season varchar(6),
 Temperature float,
 Rainfall float);

 * sqlite://
Done.

[]

In [30]:
%%sql
INSERT INTO Weather VALUES('Mumbai','India','Winter',24.8,5.9),
('Mumbai','India','Spring',28.4,16.2),
('Mumbai','India','Summer',27.9,1549.4),
('Mumbai','India','Fall',27.6,346.0),
('London','United Kingdom','Winter',4.2,207.7),
('London','United Kingdom','Spring',8.3,169.6),
('London','United Kingdom','Summer',15.7,157.0),
('London','United Kingdom','Fall',10.4,218.5),
('Cairo','Egypt','Winter',13.6,16.5),
('Cairo','Egypt','Spring',20.7,6.5),
('Cairo','Egypt','Summer',27.7,0.1),
('Cairo-','Egypt','Fall',22.2,4.5);

 * sqlite://
12 rows affected.

[]

In [31]:
%%sql
select * from Weather;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo-', 'Egypt', 'Fall', 22.2, 4.5)]

a) All the temperature data

In [32]:
%%sql
select Temperature from Weather;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

b) All the cities, but without repetition.

In [33]:
%%sql
select Distinct City from Weather;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',), ('Cairo-',)]

c) All the records for India

In [34]:
%%sql
select * from Weather Where Country='India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

d) All the Fall records.

In [35]:
%%sql
select*from Weather Where Season='Fall'

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo-', 'Egypt', 'Fall', 22.2, 4.5)]

e) The city, country, and season for which the average rainfall is between 200
and 400 millimeters.

In [36]:
%%sql
Select City,Country,Season from Weather Where Rainfall Between 200.0 And 400.0;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

f) The city and country for which the average Fall temperature is above 20
degrees, in increasing temperature order.

In [37]:
%%sql
Select City,Country,Season,Temperature from Weather Where Season='Fall' And Temperature>20 order by Temperature ASC;

 * sqlite://
Done.

[('Cairo-', 'Egypt', 'Fall', 22.2), ('Mumbai', 'India', 'Fall', 27.6)]

g) The total annual rainfall for Cairo

In [38]:
%%sql
select SUM(rainfall) As Annual from Weather where City='Cairo'

 * sqlite://
Done.

[(23.1,)]

h) The total rainfall for each season

In [39]:
%%sql
select Season, sum(Rainfall) from Weather group by Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Question 9

Suppose list words is defined as follows:
>>> words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']
Write list comprehension expressions that use list words and generate the following
lists:

In [40]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']
print(words)

['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

(a) ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE',
'LAZY', 'DOG']

In [41]:
[y.upper() for y in words]

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

(b) ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the',
'lazy', 'dog']

In [42]:
[y.lower() for y in words]

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

c) [3, 5, 5, 3, 5, 4, 3, 4, 3] (the list of lengths of words in list
words).

In [43]:
[len(y) for y in words]

[3, 5, 5, 3, 5, 4, 3, 4, 3]

d) [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN',
'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5],
['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy',
4], ['DOG', 'dog', 3]] (the list containing a list for every word of list
words, where each list contains the word in uppercase and lowercase and the
length of the word.)

In [44]:
[[i.upper(),i.lower(), len(i)] for i in words]

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

e) ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the',
'lazy', 'dog'] (the list of words in list words containing 4 or more
characters.)

In [45]:
[i for i in words if len(i)>=4]

['quick', 'brown', 'jumps', 'over', 'lazy']